TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#define G7_1PL      1       // DMA_CH1_INT
#define G7_2PL      11      // DMA_CH2_INT
#define G7_3PL      14      // DMA_CH3_INT
#define G7_4PL      3       // DMA_CH4_INT
#define G7_5PL      13      // DMA_CH5_INT
#define G7_6PL      14      // DMA_CH6_INT
#define G7_7PL      0       // Reserved
#define G7_8PL      0       // Reserved
#define G7_9PL      0       // Reserved
#define G7_10PL     0       // Reserved
#define G7_11PL     6       // FSITXA1_INT
#define G7_12PL     1       // FSITXA2_INT
#define G7_13PL     5       // FSIRXA1_INT
#define G7_14PL     5       // FSIRXA2_INT
#define G7_15PL     7       // CLA1PROMCRC_INT
#define G7_16PL     0       // Reserved

#define G8_1PL      14      // I2CA_INT
#define G8_2PL      10      // I2CA_FIFO_INT
#define G8_3PL      0       // Reserved
#define G8_4PL      0       // Reserved
#define G8_5PL      0       // Reserved
#define G8_6PL      0       // Reserved
#define G8_7PL      0       // Reserved
#define G8_8PL      0       // Reserved
#define G8_9PL      1       // LINA_0_INT
#define G8_10PL     9       // LINA_1_INT
#define G8_11PL     0       // Reserved
#define G8_12PL     0       // Reserved
#define G8_13PL     10      // PMBUSA_INT
#define G8_14PL     0       // Reserved
#define G8_15PL     0       // Reserved
#define G8_16PL     0       // Reserved

#define G9_1PL      12      // SCIA_RX_INT
#define G9_2PL      14      // SCIA_TX_INT
#define G9_3PL      11      // SCIB_RX_INT
#define G9_4PL      6       // SCIB_TX_INT
#define G9_5PL      14      // CANA0_INT
#define G9_6PL      10      // CANA1_INT
#define G9_7PL      10      // CANB0_INT
#define G9_8PL      5       // CANB1_INT
#define G9_9PL      0       // Reserved
#define G9_10PL     0       // Reserved
#define G9_11PL     0       // Reserved
#define G9_12PL     0       // Reserved
#define G9_13PL     0       // Reserved
#define G9_14PL     0       // Reserved
#define G9_15PL     0       // Reserved
#define G9_16PL     0       // Reserved

#define G10_1PL     14      // ADCA_EVT_INT
#define G10_2PL     3       // ADCA2_INT
#define G10_3PL     1       // ADCA3_INT
#define G10_4PL     12      // ADCA4_INT
#define G10_5PL     5       // ADCB_EVT_INT
#define G10_6PL     11      // ADCB2_INT
#define G10_7PL     12      // ADCB3_INT
#define G10_8PL     13      // ADCB4_INT
#define G10_9PL     7       // ADCC_EVT_INT
#define G10_10PL    8       // ADCC2_INT
#define G10_11PL    4       // ADCC3_INT
#define G10_12PL    9       // ADCC4_INT
#define G10_13PL    0       // Reserved
#define G10_14PL    0       // Reserved
#define G10_15PL    0       // Reserved
#define G10_16PL    0       // Reserved

#define G11_1PL     9       // CLA1_1_INT
#define G11_2PL     6       // CLA1_2_INT
#define G11_3PL     9       // CLA1_3_INT
#define G11_4PL     9       // CLA1_4_INT
#define G11_5PL     6       // CLA1_5_INT
#define G11_6PL     13      // CLA1_6_INT
#define G11_7PL     10      // CLA1_7_INT
#define G11_8PL     15      // CLA1_8_INT
#define G11_9PL     0       // Reserved
#define G11_10PL    0       // Reserved
#define G11_11PL    0       // Reserved
#define G11_12PL    0       // Reserved
#define G11_13PL    0       // Reserved
#define G11_14PL    0       // Reserved
#define G11_15PL    0       // Reserved
#define G11_16PL    0       // Reserved

#define G12_1PL     3       // XINT3_INT
#define G12_2PL     6       // XINT4_INT
#define G12_3PL     10      // XINT5_INT
#define G12_4PL     0       // Reserved
#define G12_5PL     0       // Reserved
#define G12_6PL     0       // Reserved
#define G12_7PL     14      // FPU_OVERFLOW_ISR
#define G12_8PL     14      // FPU_UNDERFLOW_ISR
#define G12_9PL     0       // Reserved
#define G12_10PL    5       // RAM_CORRECTABLE_ERROR_ISR
#define G12_11PL    4       // FLASH_CORRECTABLE_ERROR_ISR
#define G12_12PL    12      // RAM_ACCESS_VIOLATION_INT
#define G12_13PL    8       // SYS_PLL_SLIP_INT
#define G12_14PL    0       // Reserved
#define G12_15PL    12      // CLA_OVERFLOW_INT
#define G12_16PL    2       // CLA_UNDERFLOW_INT

//
// There should be no need to modify code below this line
//
// Automatically generate IER interrupt masks MINT1 to MINT16:
//
// Beginning of MINT1:
#if (INT1PL == 0)
#define  MINT1_1PL    ~(1 << 0)
#else
#define  MINT1_1PL    0xFFFF
#endif

#if (INT2PL >= INT1PL) || (INT2PL == 0)
#define  MINT1_2PL    ~(1 << 1)
#else
#define  MINT1_2PL    0xFFFF
#endif

#if (INT3PL >= INT1PL) || (INT3PL == 0)
#define  MINT1_3PL    ~(1 << 2)
#else
#define  MINT1_3PL    0xFFFF
#endif

#if (INT4PL >= INT1PL) || (INT4PL == 0)
#define  MINT1_4PL    ~(1 << 3)
#else
#define  MINT1_4PL    0xFFFF
#endif

#if (INT5PL >= INT1PL) || (INT5PL == 0)
#define  MINT1_5PL    ~(1 << 4)
#else
#define  MINT1_5PL    0xFFFF
#endif

#if (INT6PL >= INT1PL) || (INT6PL == 0)
#define  MINT1_6PL    ~(1 << 5)
#else
#define  MINT1_6PL    0xFFFF
#endif

#if (INT7PL >= INT1PL) || (INT7PL == 0)
#define  MINT1_7PL    ~(1 << 6)
#else
#define  MINT1_7PL    0xFFFF
#endif

#if (INT8PL >= INT1PL) || (INT8PL == 0)
#define  MINT1_8PL    ~(1 << 7)
#else
#define  MINT1_8PL    0xFFFF
#endif

#if (INT9PL >= INT1PL) || (INT9PL == 0)
#define  MINT1_9PL    ~(1 << 8)
#else
#define  MINT1_9PL    0xFFFF
#endif

#if (INT10PL >= INT1PL) || (INT10PL == 0)
#define  MINT1_10PL    ~(1 << 9)
#else
#define  MINT1_10PL    0xFFFF
#endif

#if (INT11PL >= INT1PL) || (INT11PL == 0)
#define  MINT1_11PL    ~(1 << 10)
#else
#define  MINT1_11PL    0xFFFF
#endif

#if (INT12PL >= INT1PL) || (INT12PL == 0)
#define  MINT1_12PL    ~(1 << 11)
#else
#define  MINT1_12PL    0xFFFF
#endif

#if (INT13PL >= INT1PL) || (INT13PL == 0)
#define  MINT1_13PL    ~(1 << 12)
#else
#define  MINT1_13PL    0xFFFF
#endif

#if (INT14PL >= INT1PL) || (INT14PL == 0)
#define  MINT1_14PL    ~(1 << 13)
#else
#define  MINT1_14PL    0xFFFF
#endif

#if (INT15PL >= INT1PL) || (INT15PL == 0)
#define  MINT1_15PL    ~(1 << 14)
#else
#define  MINT1_15PL    0xFFFF
#endif

#if (INT16PL >= INT1PL) || (INT16PL == 0)
#define  MINT1_16PL    ~(1 << 15)
#else
#define  MINT1_16PL    0xFFFF
#endif

#define  MINT1    (MINT1_1PL  & MINT1_2PL  & MINT1_3PL  & MINT1_4PL  & \
                   MINT1_5PL  & MINT1_6PL  & MINT1_7PL  & MINT1_8PL  & \
                   MINT1_9PL  & MINT1_10PL & MINT1_11PL & MINT1_12PL & \
                   MINT1_13PL & MINT1_14PL & MINT1_15PL & MINT1_16PL)
// End Of MINT1.

// Beginning of MINT2:
#if (INT1PL >= INT2PL) || (INT1PL == 0)
#define  MINT2_1PL    ~(1 << 0)
#else
#define  MINT2_1PL    0xFFFF
#endif

