TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#if (G6_3PL >= G6_2PL) || (G6_3PL == 0)
#define  MG6_2_13PL    ~(1 << 2)
#else
#define  MG6_2_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_2PL) || (G6_4PL == 0)
#define  MG6_2_14PL    ~(1 << 3)
#else
#define  MG6_2_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_2PL) || (G6_5PL == 0)
#define  MG6_2_15PL    ~(1 << 4)
#else
#define  MG6_2_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_2PL) || (G6_6PL == 0)
#define  MG6_2_16PL    ~(1 << 5)
#else
#define  MG6_2_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_2PL) || (G6_7PL == 0)
#define  MG6_2_17PL    ~(1 << 6)
#else
#define  MG6_2_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_2PL) || (G6_8PL == 0)
#define  MG6_2_18PL    ~(1 << 7)
#else
#define  MG6_2_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_2PL) || (G6_9PL == 0)
#define  MG6_2_19PL    ~(1 << 8)
#else
#define  MG6_2_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_2PL) || (G6_10PL == 0)
#define  MG6_2_110PL    ~(1 << 9)
#else
#define  MG6_2_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_2PL) || (G6_11PL == 0)
#define  MG6_2_111PL    ~(1 << 10)
#else
#define  MG6_2_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_2PL) || (G6_12PL == 0)
#define  MG6_2_112PL    ~(1 << 11)
#else
#define  MG6_2_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_2PL) || (G6_13PL == 0)
#define  MG6_2_113PL    ~(1 << 12)
#else
#define  MG6_2_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_2PL) || (G6_14PL == 0)
#define  MG6_2_114PL    ~(1 << 13)
#else
#define  MG6_2_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_2PL) || (G6_15PL == 0)
#define  MG6_2_115PL    ~(1 << 14)
#else
#define  MG6_2_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_2PL) || (G6_16PL == 0)
#define  MG6_2_116PL    ~(1 << 15)
#else
#define  MG6_2_116PL    0xFFFF
#endif

#define  MG6_2_12PL 0xFFFD
#define  MG6_2    (MG6_2_11PL & MG6_2_12PL & MG6_2_13PL & MG6_2_14PL & \
                    MG6_2_15PL & MG6_2_16PL & MG6_2_17PL & MG6_2_18PL & \
                    MG6_2_19PL & MG6_2_110PL & MG6_2_111PL & MG6_2_112PL & \
                    MG6_2_113PL & MG6_2_114PL & MG6_2_115PL & MG6_2_116PL)
// End of MG6_2:
// Beginning of MG63:
#if (G6_1PL >= G6_3PL) || (G6_1PL == 0)
#define  MG6_3_11PL    ~(1 << 0)
#else
#define  MG6_3_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_3PL) || (G6_2PL == 0)
#define  MG6_3_12PL    ~(1 << 1)
#else
#define  MG6_3_12PL    0xFFFF
#endif

#if (G6_4PL >= G6_3PL) || (G6_4PL == 0)
#define  MG6_3_14PL    ~(1 << 3)
#else
#define  MG6_3_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_3PL) || (G6_5PL == 0)
#define  MG6_3_15PL    ~(1 << 4)
#else
#define  MG6_3_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_3PL) || (G6_6PL == 0)
#define  MG6_3_16PL    ~(1 << 5)
#else
#define  MG6_3_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_3PL) || (G6_7PL == 0)
#define  MG6_3_17PL    ~(1 << 6)
#else
#define  MG6_3_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_3PL) || (G6_8PL == 0)
#define  MG6_3_18PL    ~(1 << 7)
#else
#define  MG6_3_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_3PL) || (G6_9PL == 0)
#define  MG6_3_19PL    ~(1 << 8)
#else
#define  MG6_3_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_3PL) || (G6_10PL == 0)
#define  MG6_3_110PL    ~(1 << 9)
#else
#define  MG6_3_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_3PL) || (G6_11PL == 0)
#define  MG6_3_111PL    ~(1 << 10)
#else
#define  MG6_3_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_3PL) || (G6_12PL == 0)
#define  MG6_3_112PL    ~(1 << 11)
#else
#define  MG6_3_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_3PL) || (G6_13PL == 0)
#define  MG6_3_113PL    ~(1 << 12)
#else
#define  MG6_3_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_3PL) || (G6_14PL == 0)
#define  MG6_3_114PL    ~(1 << 13)
#else
#define  MG6_3_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_3PL) || (G6_15PL == 0)
#define  MG6_3_115PL    ~(1 << 14)
#else
#define  MG6_3_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_3PL) || (G6_16PL == 0)
#define  MG6_3_116PL    ~(1 << 15)
#else
#define  MG6_3_116PL    0xFFFF
#endif

#define  MG6_3_13PL 0xFFFB
#define  MG6_3    (MG6_3_11PL & MG6_3_12PL & MG6_3_13PL & MG6_3_14PL & \
                    MG6_3_15PL & MG6_3_16PL & MG6_3_17PL & MG6_3_18PL & \
                    MG6_3_19PL & MG6_3_110PL & MG6_3_111PL & MG6_3_112PL & \
                    MG6_3_113PL & MG6_3_114PL & MG6_3_115PL & MG6_3_116PL)
// End of MG6_3:
// Beginning of MG64:
#if (G6_1PL >= G6_4PL) || (G6_1PL == 0)
#define  MG6_4_11PL    ~(1 << 0)
#else
#define  MG6_4_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_4PL) || (G6_2PL == 0)
#define  MG6_4_12PL    ~(1 << 1)
#else
#define  MG6_4_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_4PL) || (G6_3PL == 0)
#define  MG6_4_13PL    ~(1 << 2)
#else
#define  MG6_4_13PL    0xFFFF
#endif

#if (G6_5PL >= G6_4PL) || (G6_5PL == 0)
#define  MG6_4_15PL    ~(1 << 4)
#else
#define  MG6_4_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_4PL) || (G6_6PL == 0)
#define  MG6_4_16PL    ~(1 << 5)
#else
#define  MG6_4_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_4PL) || (G6_7PL == 0)
#define  MG6_4_17PL    ~(1 << 6)
#else
#define  MG6_4_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_4PL) || (G6_8PL == 0)
#define  MG6_4_18PL    ~(1 << 7)
#else
#define  MG6_4_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_4PL) || (G6_9PL == 0)
#define  MG6_4_19PL    ~(1 << 8)
#else
#define  MG6_4_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_4PL) || (G6_10PL == 0)
#define  MG6_4_110PL    ~(1 << 9)
#else
#define  MG6_4_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_4PL) || (G6_11PL == 0)
#define  MG6_4_111PL    ~(1 << 10)
#else
#define  MG6_4_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_4PL) || (G6_12PL == 0)
#define  MG6_4_112PL    ~(1 << 11)
#else
#define  MG6_4_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_4PL) || (G6_13PL == 0)
#define  MG6_4_113PL    ~(1 << 12)
#else
#define  MG6_4_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_4PL) || (G6_14PL == 0)
#define  MG6_4_114PL    ~(1 << 13)
#else
#define  MG6_4_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_4PL) || (G6_15PL == 0)
#define  MG6_4_115PL    ~(1 << 14)
#else
#define  MG6_4_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_4PL) || (G6_16PL == 0)
#define  MG6_4_116PL    ~(1 << 15)
#else
#define  MG6_4_116PL    0xFFFF
#endif

#define  MG6_4_14PL 0xFFF7
#define  MG6_4    (MG6_4_11PL & MG6_4_12PL & MG6_4_13PL & MG6_4_14PL & \
                    MG6_4_15PL & MG6_4_16PL & MG6_4_17PL & MG6_4_18PL & \
                    MG6_4_19PL & MG6_4_110PL & MG6_4_111PL & MG6_4_112PL & \
                    MG6_4_113PL & MG6_4_114PL & MG6_4_115PL & MG6_4_116PL)
// End of MG6_4:
// Beginning of MG65:
#if (G6_1PL >= G6_5PL) || (G6_1PL == 0)
#define  MG6_5_11PL    ~(1 << 0)
#else
#define  MG6_5_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_5PL) || (G6_2PL == 0)
#define  MG6_5_12PL    ~(1 << 1)
#else
#define  MG6_5_12PL    0xFFFF
#endif

