TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#if (G8_7PL >= G8_13PL) || (G8_7PL == 0)
#define  MG8_13_17PL    ~(1 << 6)
#else
#define  MG8_13_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_13PL) || (G8_8PL == 0)
#define  MG8_13_18PL    ~(1 << 7)
#else
#define  MG8_13_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_13PL) || (G8_9PL == 0)
#define  MG8_13_19PL    ~(1 << 8)
#else
#define  MG8_13_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_13PL) || (G8_10PL == 0)
#define  MG8_13_110PL    ~(1 << 9)
#else
#define  MG8_13_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_13PL) || (G8_11PL == 0)
#define  MG8_13_111PL    ~(1 << 10)
#else
#define  MG8_13_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_13PL) || (G8_12PL == 0)
#define  MG8_13_112PL    ~(1 << 11)
#else
#define  MG8_13_112PL    0xFFFF
#endif

#if (G8_14PL >= G8_13PL) || (G8_14PL == 0)
#define  MG8_13_114PL    ~(1 << 13)
#else
#define  MG8_13_114PL    0xFFFF
#endif

#if (G8_15PL >= G8_13PL) || (G8_15PL == 0)
#define  MG8_13_115PL    ~(1 << 14)
#else
#define  MG8_13_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_13PL) || (G8_16PL == 0)
#define  MG8_13_116PL    ~(1 << 15)
#else
#define  MG8_13_116PL    0xFFFF
#endif

#define  MG8_13_113PL   0xEFFF
#define  MG8_13    (MG8_13_11PL & MG8_13_12PL & MG8_13_13PL & MG8_13_14PL & \
                    MG8_13_15PL & MG8_13_16PL & MG8_13_17PL & MG8_13_18PL & \
                    MG8_13_19PL & MG8_13_110PL & MG8_13_111PL & MG8_13_112PL & \
                    MG8_13_113PL & MG8_13_114PL & MG8_13_115PL & MG8_13_116PL)
// End of MG8_13:
// Beginning of MG814:
#if (G8_1PL >= G8_14PL) || (G8_1PL == 0)
#define  MG8_14_11PL    ~(1 << 0)
#else
#define  MG8_14_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_14PL) || (G8_2PL == 0)
#define  MG8_14_12PL    ~(1 << 1)
#else
#define  MG8_14_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_14PL) || (G8_3PL == 0)
#define  MG8_14_13PL    ~(1 << 2)
#else
#define  MG8_14_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_14PL) || (G8_4PL == 0)
#define  MG8_14_14PL    ~(1 << 3)
#else
#define  MG8_14_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_14PL) || (G8_5PL == 0)
#define  MG8_14_15PL    ~(1 << 4)
#else
#define  MG8_14_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_14PL) || (G8_6PL == 0)
#define  MG8_14_16PL    ~(1 << 5)
#else
#define  MG8_14_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_14PL) || (G8_7PL == 0)
#define  MG8_14_17PL    ~(1 << 6)
#else
#define  MG8_14_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_14PL) || (G8_8PL == 0)
#define  MG8_14_18PL    ~(1 << 7)
#else
#define  MG8_14_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_14PL) || (G8_9PL == 0)
#define  MG8_14_19PL    ~(1 << 8)
#else
#define  MG8_14_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_14PL) || (G8_10PL == 0)
#define  MG8_14_110PL    ~(1 << 9)
#else
#define  MG8_14_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_14PL) || (G8_11PL == 0)
#define  MG8_14_111PL    ~(1 << 10)
#else
#define  MG8_14_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_14PL) || (G8_12PL == 0)
#define  MG8_14_112PL    ~(1 << 11)
#else
#define  MG8_14_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_14PL) || (G8_13PL == 0)
#define  MG8_14_113PL    ~(1 << 12)
#else
#define  MG8_14_113PL    0xFFFF
#endif

#if (G8_15PL >= G8_14PL) || (G8_15PL == 0)
#define  MG8_14_115PL    ~(1 << 14)
#else
#define  MG8_14_115PL    0xFFFF
#endif

#if (G8_16PL >= G8_14PL) || (G8_16PL == 0)
#define  MG8_14_116PL    ~(1 << 15)
#else
#define  MG8_14_116PL    0xFFFF
#endif

#define  MG8_14_114PL   0xDFFF
#define  MG8_14    (MG8_14_11PL & MG8_14_12PL & MG8_14_13PL & MG8_14_14PL & \
                    MG8_14_15PL & MG8_14_16PL & MG8_14_17PL & MG8_14_18PL & \
                    MG8_14_19PL & MG8_14_110PL & MG8_14_111PL & MG8_14_112PL & \
                    MG8_14_113PL & MG8_14_114PL & MG8_14_115PL & MG8_14_116PL)
// End of MG8_14:
// Beginning of MG815:
#if (G8_1PL >= G8_15PL) || (G8_1PL == 0)
#define  MG8_15_11PL    ~(1 << 0)
#else
#define  MG8_15_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_15PL) || (G8_2PL == 0)
#define  MG8_15_12PL    ~(1 << 1)
#else
#define  MG8_15_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_15PL) || (G8_3PL == 0)
#define  MG8_15_13PL    ~(1 << 2)
#else
#define  MG8_15_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_15PL) || (G8_4PL == 0)
#define  MG8_15_14PL    ~(1 << 3)
#else
#define  MG8_15_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_15PL) || (G8_5PL == 0)
#define  MG8_15_15PL    ~(1 << 4)
#else
#define  MG8_15_15PL    0xFFFF
#endif

#if (G8_6PL >= G8_15PL) || (G8_6PL == 0)
#define  MG8_15_16PL    ~(1 << 5)
#else
#define  MG8_15_16PL    0xFFFF
#endif

#if (G8_7PL >= G8_15PL) || (G8_7PL == 0)
#define  MG8_15_17PL    ~(1 << 6)
#else
#define  MG8_15_17PL    0xFFFF
#endif

#if (G8_8PL >= G8_15PL) || (G8_8PL == 0)
#define  MG8_15_18PL    ~(1 << 7)
#else
#define  MG8_15_18PL    0xFFFF
#endif

#if (G8_9PL >= G8_15PL) || (G8_9PL == 0)
#define  MG8_15_19PL    ~(1 << 8)
#else
#define  MG8_15_19PL    0xFFFF
#endif

#if (G8_10PL >= G8_15PL) || (G8_10PL == 0)
#define  MG8_15_110PL    ~(1 << 9)
#else
#define  MG8_15_110PL    0xFFFF
#endif

#if (G8_11PL >= G8_15PL) || (G8_11PL == 0)
#define  MG8_15_111PL    ~(1 << 10)
#else
#define  MG8_15_111PL    0xFFFF
#endif

#if (G8_12PL >= G8_15PL) || (G8_12PL == 0)
#define  MG8_15_112PL    ~(1 << 11)
#else
#define  MG8_15_112PL    0xFFFF
#endif

#if (G8_13PL >= G8_15PL) || (G8_13PL == 0)
#define  MG8_15_113PL    ~(1 << 12)
#else
#define  MG8_15_113PL    0xFFFF
#endif

#if (G8_14PL >= G8_15PL) || (G8_14PL == 0)
#define  MG8_15_114PL    ~(1 << 13)
#else
#define  MG8_15_114PL    0xFFFF
#endif

#if (G8_16PL >= G8_15PL) || (G8_16PL == 0)
#define  MG8_15_116PL    ~(1 << 15)
#else
#define  MG8_15_116PL    0xFFFF
#endif

#define  MG8_15_115PL   0xBFFF
#define  MG8_15    (MG8_15_11PL & MG8_15_12PL & MG8_15_13PL & MG8_15_14PL & \
                    MG8_15_15PL & MG8_15_16PL & MG8_15_17PL & MG8_15_18PL & \
                    MG8_15_19PL & MG8_15_110PL & MG8_15_111PL & MG8_15_112PL & \
                    MG8_15_113PL & MG8_15_114PL & MG8_15_115PL & MG8_15_116PL)
// End of MG8_15:
// Beginning of MG816:
#if (G8_1PL >= G8_16PL) || (G8_1PL == 0)
#define  MG8_16_11PL    ~(1 << 0)
#else
#define  MG8_16_11PL    0xFFFF
#endif

#if (G8_2PL >= G8_16PL) || (G8_2PL == 0)
#define  MG8_16_12PL    ~(1 << 1)
#else
#define  MG8_16_12PL    0xFFFF
#endif

#if (G8_3PL >= G8_16PL) || (G8_3PL == 0)
#define  MG8_16_13PL    ~(1 << 2)
#else
#define  MG8_16_13PL    0xFFFF
#endif

#if (G8_4PL >= G8_16PL) || (G8_4PL == 0)
#define  MG8_16_14PL    ~(1 << 3)
#else
#define  MG8_16_14PL    0xFFFF
#endif

#if (G8_5PL >= G8_16PL) || (G8_5PL == 0)
#define  MG8_16_15PL    ~(1 << 4)
#else
#define  MG8_16_15PL    0xFFFF
#endif

