TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#if (G10_4PL >= G10_15PL) || (G10_4PL == 0)
#define  MG10_15_14PL    ~(1 << 3)
#else
#define  MG10_15_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_15PL) || (G10_5PL == 0)
#define  MG10_15_15PL    ~(1 << 4)
#else
#define  MG10_15_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_15PL) || (G10_6PL == 0)
#define  MG10_15_16PL    ~(1 << 5)
#else
#define  MG10_15_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_15PL) || (G10_7PL == 0)
#define  MG10_15_17PL    ~(1 << 6)
#else
#define  MG10_15_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_15PL) || (G10_8PL == 0)
#define  MG10_15_18PL    ~(1 << 7)
#else
#define  MG10_15_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_15PL) || (G10_9PL == 0)
#define  MG10_15_19PL    ~(1 << 8)
#else
#define  MG10_15_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_15PL) || (G10_10PL == 0)
#define  MG10_15_110PL    ~(1 << 9)
#else
#define  MG10_15_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_15PL) || (G10_11PL == 0)
#define  MG10_15_111PL    ~(1 << 10)
#else
#define  MG10_15_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_15PL) || (G10_12PL == 0)
#define  MG10_15_112PL    ~(1 << 11)
#else
#define  MG10_15_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_15PL) || (G10_13PL == 0)
#define  MG10_15_113PL    ~(1 << 12)
#else
#define  MG10_15_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_15PL) || (G10_14PL == 0)
#define  MG10_15_114PL    ~(1 << 13)
#else
#define  MG10_15_114PL    0xFFFF
#endif

#if (G10_16PL >= G10_15PL) || (G10_16PL == 0)
#define  MG10_15_116PL    ~(1 << 15)
#else
#define  MG10_15_116PL    0xFFFF
#endif

#define  MG10_15_115PL  0xBFFF
#define  MG10_15    (MG10_15_11PL & MG10_15_12PL & MG10_15_13PL & MG10_15_14PL & \
                    MG10_15_15PL & MG10_15_16PL & MG10_15_17PL & MG10_15_18PL & \
                    MG10_15_19PL & MG10_15_110PL & MG10_15_111PL & MG10_15_112PL & \
                    MG10_15_113PL & MG10_15_114PL & MG10_15_115PL & MG10_15_116PL)
// End of MG10_15:
// Beginning of MG1016:
#if (G10_1PL >= G10_16PL) || (G10_1PL == 0)
#define  MG10_16_11PL    ~(1 << 0)
#else
#define  MG10_16_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_16PL) || (G10_2PL == 0)
#define  MG10_16_12PL    ~(1 << 1)
#else
#define  MG10_16_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_16PL) || (G10_3PL == 0)
#define  MG10_16_13PL    ~(1 << 2)
#else
#define  MG10_16_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_16PL) || (G10_4PL == 0)
#define  MG10_16_14PL    ~(1 << 3)
#else
#define  MG10_16_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_16PL) || (G10_5PL == 0)
#define  MG10_16_15PL    ~(1 << 4)
#else
#define  MG10_16_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_16PL) || (G10_6PL == 0)
#define  MG10_16_16PL    ~(1 << 5)
#else
#define  MG10_16_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_16PL) || (G10_7PL == 0)
#define  MG10_16_17PL    ~(1 << 6)
#else
#define  MG10_16_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_16PL) || (G10_8PL == 0)
#define  MG10_16_18PL    ~(1 << 7)
#else
#define  MG10_16_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_16PL) || (G10_9PL == 0)
#define  MG10_16_19PL    ~(1 << 8)
#else
#define  MG10_16_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_16PL) || (G10_10PL == 0)
#define  MG10_16_110PL    ~(1 << 9)
#else
#define  MG10_16_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_16PL) || (G10_11PL == 0)
#define  MG10_16_111PL    ~(1 << 10)
#else
#define  MG10_16_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_16PL) || (G10_12PL == 0)
#define  MG10_16_112PL    ~(1 << 11)
#else
#define  MG10_16_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_16PL) || (G10_13PL == 0)
#define  MG10_16_113PL    ~(1 << 12)
#else
#define  MG10_16_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_16PL) || (G10_14PL == 0)
#define  MG10_16_114PL    ~(1 << 13)
#else
#define  MG10_16_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_16PL) || (G10_15PL == 0)
#define  MG10_16_115PL    ~(1 << 14)
#else
#define  MG10_16_115PL    0xFFFF
#endif

#define  MG10_16_116PL  0x7FFF
#define  MG10_16    (MG10_16_11PL & MG10_16_12PL & MG10_16_13PL & MG10_16_14PL & \
                    MG10_16_15PL & MG10_16_16PL & MG10_16_17PL & MG10_16_18PL & \
                    MG10_16_19PL & MG10_16_110PL & MG10_16_111PL & MG10_16_112PL & \
                    MG10_16_113PL & MG10_16_114PL & MG10_16_115PL & MG10_16_116PL)
// End of MG10_16:


//
// Automatically generate PIEIER11 interrupt masks MG111 to MG1116:
//

// Beginning of MG111:
#if (G11_2PL >= G11_1PL) || (G11_2PL == 0)
#define  MG11_1_12PL    ~(1 << 1)
#else
#define  MG11_1_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_1PL) || (G11_3PL == 0)
#define  MG11_1_13PL    ~(1 << 2)
#else
#define  MG11_1_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_1PL) || (G11_4PL == 0)
#define  MG11_1_14PL    ~(1 << 3)
#else
#define  MG11_1_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_1PL) || (G11_5PL == 0)
#define  MG11_1_15PL    ~(1 << 4)
#else
#define  MG11_1_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_1PL) || (G11_6PL == 0)
#define  MG11_1_16PL    ~(1 << 5)
#else
#define  MG11_1_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_1PL) || (G11_7PL == 0)
#define  MG11_1_17PL    ~(1 << 6)
#else
#define  MG11_1_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_1PL) || (G11_8PL == 0)
#define  MG11_1_18PL    ~(1 << 7)
#else
#define  MG11_1_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_1PL) || (G11_9PL == 0)
#define  MG11_1_19PL    ~(1 << 8)
#else
#define  MG11_1_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_1PL) || (G11_10PL == 0)
#define  MG11_1_110PL    ~(1 << 9)
#else
#define  MG11_1_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_1PL) || (G11_11PL == 0)
#define  MG11_1_111PL    ~(1 << 10)
#else
#define  MG11_1_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_1PL) || (G11_12PL == 0)
#define  MG11_1_112PL    ~(1 << 11)
#else
#define  MG11_1_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_1PL) || (G11_13PL == 0)
#define  MG11_1_113PL    ~(1 << 12)
#else
#define  MG11_1_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_1PL) || (G11_14PL == 0)
#define  MG11_1_114PL    ~(1 << 13)
#else
#define  MG11_1_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_1PL) || (G11_15PL == 0)
#define  MG11_1_115PL    ~(1 << 14)
#else
#define  MG11_1_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_1PL) || (G11_16PL == 0)
#define  MG11_1_116PL    ~(1 << 15)
#else
#define  MG11_1_116PL    0xFFFF
#endif

