TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#if (G11_14PL >= G11_4PL) || (G11_14PL == 0)
#define  MG11_4_114PL    ~(1 << 13)
#else
#define  MG11_4_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_4PL) || (G11_15PL == 0)
#define  MG11_4_115PL    ~(1 << 14)
#else
#define  MG11_4_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_4PL) || (G11_16PL == 0)
#define  MG11_4_116PL    ~(1 << 15)
#else
#define  MG11_4_116PL    0xFFFF
#endif

#define  MG11_4_14PL    0xFFF7
#define  MG11_4    (MG11_4_11PL & MG11_4_12PL & MG11_4_13PL & MG11_4_14PL & \
                    MG11_4_15PL & MG11_4_16PL & MG11_4_17PL & MG11_4_18PL & \
                    MG11_4_19PL & MG11_4_110PL & MG11_4_111PL & MG11_4_112PL & \
                    MG11_4_113PL & MG11_4_114PL & MG11_4_115PL & MG11_4_116PL)
// End of MG11_4:
// Beginning of MG115:
#if (G11_1PL >= G11_5PL) || (G11_1PL == 0)
#define  MG11_5_11PL    ~(1 << 0)
#else
#define  MG11_5_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_5PL) || (G11_2PL == 0)
#define  MG11_5_12PL    ~(1 << 1)
#else
#define  MG11_5_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_5PL) || (G11_3PL == 0)
#define  MG11_5_13PL    ~(1 << 2)
#else
#define  MG11_5_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_5PL) || (G11_4PL == 0)
#define  MG11_5_14PL    ~(1 << 3)
#else
#define  MG11_5_14PL    0xFFFF
#endif

#if (G11_6PL >= G11_5PL) || (G11_6PL == 0)
#define  MG11_5_16PL    ~(1 << 5)
#else
#define  MG11_5_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_5PL) || (G11_7PL == 0)
#define  MG11_5_17PL    ~(1 << 6)
#else
#define  MG11_5_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_5PL) || (G11_8PL == 0)
#define  MG11_5_18PL    ~(1 << 7)
#else
#define  MG11_5_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_5PL) || (G11_9PL == 0)
#define  MG11_5_19PL    ~(1 << 8)
#else
#define  MG11_5_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_5PL) || (G11_10PL == 0)
#define  MG11_5_110PL    ~(1 << 9)
#else
#define  MG11_5_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_5PL) || (G11_11PL == 0)
#define  MG11_5_111PL    ~(1 << 10)
#else
#define  MG11_5_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_5PL) || (G11_12PL == 0)
#define  MG11_5_112PL    ~(1 << 11)
#else
#define  MG11_5_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_5PL) || (G11_13PL == 0)
#define  MG11_5_113PL    ~(1 << 12)
#else
#define  MG11_5_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_5PL) || (G11_14PL == 0)
#define  MG11_5_114PL    ~(1 << 13)
#else
#define  MG11_5_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_5PL) || (G11_15PL == 0)
#define  MG11_5_115PL    ~(1 << 14)
#else
#define  MG11_5_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_5PL) || (G11_16PL == 0)
#define  MG11_5_116PL    ~(1 << 15)
#else
#define  MG11_5_116PL    0xFFFF
#endif

#define  MG11_5_15PL    0xFFEF
#define  MG11_5    (MG11_5_11PL & MG11_5_12PL & MG11_5_13PL & MG11_5_14PL & \
                    MG11_5_15PL & MG11_5_16PL & MG11_5_17PL & MG11_5_18PL & \
                    MG11_5_19PL & MG11_5_110PL & MG11_5_111PL & MG11_5_112PL & \
                    MG11_5_113PL & MG11_5_114PL & MG11_5_115PL & MG11_5_116PL)
// End of MG11_5:
// Beginning of MG116:
#if (G11_1PL >= G11_6PL) || (G11_1PL == 0)
#define  MG11_6_11PL    ~(1 << 0)
#else
#define  MG11_6_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_6PL) || (G11_2PL == 0)
#define  MG11_6_12PL    ~(1 << 1)
#else
#define  MG11_6_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_6PL) || (G11_3PL == 0)
#define  MG11_6_13PL    ~(1 << 2)
#else
#define  MG11_6_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_6PL) || (G11_4PL == 0)
#define  MG11_6_14PL    ~(1 << 3)
#else
#define  MG11_6_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_6PL) || (G11_5PL == 0)
#define  MG11_6_15PL    ~(1 << 4)
#else
#define  MG11_6_15PL    0xFFFF
#endif

#if (G11_7PL >= G11_6PL) || (G11_7PL == 0)
#define  MG11_6_17PL    ~(1 << 6)
#else
#define  MG11_6_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_6PL) || (G11_8PL == 0)
#define  MG11_6_18PL    ~(1 << 7)
#else
#define  MG11_6_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_6PL) || (G11_9PL == 0)
#define  MG11_6_19PL    ~(1 << 8)
#else
#define  MG11_6_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_6PL) || (G11_10PL == 0)
#define  MG11_6_110PL    ~(1 << 9)
#else
#define  MG11_6_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_6PL) || (G11_11PL == 0)
#define  MG11_6_111PL    ~(1 << 10)
#else
#define  MG11_6_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_6PL) || (G11_12PL == 0)
#define  MG11_6_112PL    ~(1 << 11)
#else
#define  MG11_6_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_6PL) || (G11_13PL == 0)
#define  MG11_6_113PL    ~(1 << 12)
#else
#define  MG11_6_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_6PL) || (G11_14PL == 0)
#define  MG11_6_114PL    ~(1 << 13)
#else
#define  MG11_6_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_6PL) || (G11_15PL == 0)
#define  MG11_6_115PL    ~(1 << 14)
#else
#define  MG11_6_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_6PL) || (G11_16PL == 0)
#define  MG11_6_116PL    ~(1 << 15)
#else
#define  MG11_6_116PL    0xFFFF
#endif

#define  MG11_6_16PL    0xFFDF
#define  MG11_6    (MG11_6_11PL & MG11_6_12PL & MG11_6_13PL & MG11_6_14PL & \
                    MG11_6_15PL & MG11_6_16PL & MG11_6_17PL & MG11_6_18PL & \
                    MG11_6_19PL & MG11_6_110PL & MG11_6_111PL & MG11_6_112PL & \
                    MG11_6_113PL & MG11_6_114PL & MG11_6_115PL & MG11_6_116PL)
// End of MG11_6:
// Beginning of MG117:
#if (G11_1PL >= G11_7PL) || (G11_1PL == 0)
#define  MG11_7_11PL    ~(1 << 0)
#else
#define  MG11_7_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_7PL) || (G11_2PL == 0)
#define  MG11_7_12PL    ~(1 << 1)
#else
#define  MG11_7_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_7PL) || (G11_3PL == 0)
#define  MG11_7_13PL    ~(1 << 2)
#else
#define  MG11_7_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_7PL) || (G11_4PL == 0)
#define  MG11_7_14PL    ~(1 << 3)
#else
#define  MG11_7_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_7PL) || (G11_5PL == 0)
#define  MG11_7_15PL    ~(1 << 4)
#else
#define  MG11_7_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_7PL) || (G11_6PL == 0)
#define  MG11_7_16PL    ~(1 << 5)
#else
#define  MG11_7_16PL    0xFFFF
#endif

#if (G11_8PL >= G11_7PL) || (G11_8PL == 0)
#define  MG11_7_18PL    ~(1 << 7)
#else
#define  MG11_7_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_7PL) || (G11_9PL == 0)
#define  MG11_7_19PL    ~(1 << 8)
#else
#define  MG11_7_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_7PL) || (G11_10PL == 0)
#define  MG11_7_110PL    ~(1 << 9)
#else
#define  MG11_7_110PL    0xFFFF
#endif

