TexasInstruments/c2000ware-core-sdk/device_support/f28004x/common/include/f28004x_sw_prioritized_isr_levels.h
#if (G12_11PL >= G12_2PL) || (G12_11PL == 0)
#define  MG12_2_111PL    ~(1 << 10)
#else
#define  MG12_2_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_2PL) || (G12_12PL == 0)
#define  MG12_2_112PL    ~(1 << 11)
#else
#define  MG12_2_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_2PL) || (G12_13PL == 0)
#define  MG12_2_113PL    ~(1 << 12)
#else
#define  MG12_2_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_2PL) || (G12_14PL == 0)
#define  MG12_2_114PL    ~(1 << 13)
#else
#define  MG12_2_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_2PL) || (G12_15PL == 0)
#define  MG12_2_115PL    ~(1 << 14)
#else
#define  MG12_2_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_2PL) || (G12_16PL == 0)
#define  MG12_2_116PL    ~(1 << 15)
#else
#define  MG12_2_116PL    0xFFFF
#endif

#define  MG12_2_12PL    0xFFFD
#define  MG12_2    (MG12_2_11PL & MG12_2_12PL & MG12_2_13PL & MG12_2_14PL & \
                    MG12_2_15PL & MG12_2_16PL & MG12_2_17PL & MG12_2_18PL & \
                    MG12_2_19PL & MG12_2_110PL & MG12_2_111PL & MG12_2_112PL & \
                    MG12_2_113PL & MG12_2_114PL & MG12_2_115PL & MG12_2_116PL)
// End of MG12_2:
// Beginning of MG123:
#if (G12_1PL >= G12_3PL) || (G12_1PL == 0)
#define  MG12_3_11PL    ~(1 << 0)
#else
#define  MG12_3_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_3PL) || (G12_2PL == 0)
#define  MG12_3_12PL    ~(1 << 1)
#else
#define  MG12_3_12PL    0xFFFF
#endif

#if (G12_4PL >= G12_3PL) || (G12_4PL == 0)
#define  MG12_3_14PL    ~(1 << 3)
#else
#define  MG12_3_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_3PL) || (G12_5PL == 0)
#define  MG12_3_15PL    ~(1 << 4)
#else
#define  MG12_3_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_3PL) || (G12_6PL == 0)
#define  MG12_3_16PL    ~(1 << 5)
#else
#define  MG12_3_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_3PL) || (G12_7PL == 0)
#define  MG12_3_17PL    ~(1 << 6)
#else
#define  MG12_3_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_3PL) || (G12_8PL == 0)
#define  MG12_3_18PL    ~(1 << 7)
#else
#define  MG12_3_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_3PL) || (G12_9PL == 0)
#define  MG12_3_19PL    ~(1 << 8)
#else
#define  MG12_3_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_3PL) || (G12_10PL == 0)
#define  MG12_3_110PL    ~(1 << 9)
#else
#define  MG12_3_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_3PL) || (G12_11PL == 0)
#define  MG12_3_111PL    ~(1 << 10)
#else
#define  MG12_3_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_3PL) || (G12_12PL == 0)
#define  MG12_3_112PL    ~(1 << 11)
#else
#define  MG12_3_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_3PL) || (G12_13PL == 0)
#define  MG12_3_113PL    ~(1 << 12)
#else
#define  MG12_3_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_3PL) || (G12_14PL == 0)
#define  MG12_3_114PL    ~(1 << 13)
#else
#define  MG12_3_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_3PL) || (G12_15PL == 0)
#define  MG12_3_115PL    ~(1 << 14)
#else
#define  MG12_3_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_3PL) || (G12_16PL == 0)
#define  MG12_3_116PL    ~(1 << 15)
#else
#define  MG12_3_116PL    0xFFFF
#endif

#define  MG12_3_13PL    0xFFFB
#define  MG12_3    (MG12_3_11PL & MG12_3_12PL & MG12_3_13PL & MG12_3_14PL & \
                    MG12_3_15PL & MG12_3_16PL & MG12_3_17PL & MG12_3_18PL & \
                    MG12_3_19PL & MG12_3_110PL & MG12_3_111PL & MG12_3_112PL & \
                    MG12_3_113PL & MG12_3_114PL & MG12_3_115PL & MG12_3_116PL)
// End of MG12_3:
// Beginning of MG124:
#if (G12_1PL >= G12_4PL) || (G12_1PL == 0)
#define  MG12_4_11PL    ~(1 << 0)
#else
#define  MG12_4_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_4PL) || (G12_2PL == 0)
#define  MG12_4_12PL    ~(1 << 1)
#else
#define  MG12_4_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_4PL) || (G12_3PL == 0)
#define  MG12_4_13PL    ~(1 << 2)
#else
#define  MG12_4_13PL    0xFFFF
#endif

#if (G12_5PL >= G12_4PL) || (G12_5PL == 0)
#define  MG12_4_15PL    ~(1 << 4)
#else
#define  MG12_4_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_4PL) || (G12_6PL == 0)
#define  MG12_4_16PL    ~(1 << 5)
#else
#define  MG12_4_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_4PL) || (G12_7PL == 0)
#define  MG12_4_17PL    ~(1 << 6)
#else
#define  MG12_4_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_4PL) || (G12_8PL == 0)
#define  MG12_4_18PL    ~(1 << 7)
#else
#define  MG12_4_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_4PL) || (G12_9PL == 0)
#define  MG12_4_19PL    ~(1 << 8)
#else
#define  MG12_4_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_4PL) || (G12_10PL == 0)
#define  MG12_4_110PL    ~(1 << 9)
#else
#define  MG12_4_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_4PL) || (G12_11PL == 0)
#define  MG12_4_111PL    ~(1 << 10)
#else
#define  MG12_4_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_4PL) || (G12_12PL == 0)
#define  MG12_4_112PL    ~(1 << 11)
#else
#define  MG12_4_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_4PL) || (G12_13PL == 0)
#define  MG12_4_113PL    ~(1 << 12)
#else
#define  MG12_4_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_4PL) || (G12_14PL == 0)
#define  MG12_4_114PL    ~(1 << 13)
#else
#define  MG12_4_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_4PL) || (G12_15PL == 0)
#define  MG12_4_115PL    ~(1 << 14)
#else
#define  MG12_4_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_4PL) || (G12_16PL == 0)
#define  MG12_4_116PL    ~(1 << 15)
#else
#define  MG12_4_116PL    0xFFFF
#endif

#define  MG12_4_14PL    0xFFF7
#define  MG12_4    (MG12_4_11PL & MG12_4_12PL & MG12_4_13PL & MG12_4_14PL & \
                    MG12_4_15PL & MG12_4_16PL & MG12_4_17PL & MG12_4_18PL & \
                    MG12_4_19PL & MG12_4_110PL & MG12_4_111PL & MG12_4_112PL & \
                    MG12_4_113PL & MG12_4_114PL & MG12_4_115PL & MG12_4_116PL)
// End of MG12_4:
// Beginning of MG125:
#if (G12_1PL >= G12_5PL) || (G12_1PL == 0)
#define  MG12_5_11PL    ~(1 << 0)
#else
#define  MG12_5_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_5PL) || (G12_2PL == 0)
#define  MG12_5_12PL    ~(1 << 1)
#else
#define  MG12_5_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_5PL) || (G12_3PL == 0)
#define  MG12_5_13PL    ~(1 << 2)
#else
#define  MG12_5_13PL    0xFFFF
#endif

